tiborsimon/embedded-tdd-headers/pic/8bit/pic18c801_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC18C801_H_
#define _PIC18C801_H_

#define PORTA                         0
#define ULPWUIN                       1
#define AN0                           2
#define PORTA_RA0                     3
#define AN1                           4
#define PORTA_RA1                     5
#define AN2                           6
#define PORTA_RA2                     7
#define VREFN                         8
#define VREFM                         9
#define AN3                           10
#define PORTA_RA3                     11
#define VREFP                         12
#define PORTA_RA4                     13
#define T0CKI                         14
#define AN4                           15
#define PORTA_RA5                     16
#define LVDIN                         17
#define SS                            18
#define PORTA_RA6                     19
#define OSC2                          20
#define CLK0                          21
#define PORTB                         22
#define PORTB_RB0                     23
#define INT0                          24
#define PORTB_RB1                     25
#define INT1                          26
#define INT2                          27
#define PORTB_RB2                     28
#define CCP2_PA2                      29
#define PORTB_RB3                     30
#define PORTB_CCP2                    31
#define PORTB_RB4                     32
#define PORTB_RB5                     33
#define PORTB_RB6                     34
#define PORTB_RB7                     35
#define PORTC                         36
#define T1CKI                         37
#define T1OSO                         38
#define PORTC_RC0                     39
#define PORTC_CCP2                    40
#define T1OSI                         41
#define PA2                           42
#define PORTC_RC1                     43
#define CCP1                          44
#define PA1                           45
#define PORTC_RC2                     46
#define SCL                           47
#define SCK                           48
#define PORTC_RC3                     49
#define SDA                           50
#define SDI                           51
#define PORTC_RC4                     52
#define SDO                           53
#define PORTC_RC5                     54
#define TX                            55
#define CK                            56
#define PORTC_RC6                     57
#define DT                            58
#define RX                            59
#define PORTC_RC7                     60
#define PORTD                         61
#define AD0                           62
#define PORTD_RD0                     63
#define PORTD_RD1                     64
#define AD1                           65
#define PORTD_RD2                     66
#define AD2                           67
#define PORTD_RD3                     68
#define AD3                           69
#define AD4                           70
#define PORTD_RD4                     71
#define PORTD_RD5                     72
#define AD5                           73
#define PORTD_RD6                     74
#define AD6                           75
#define PORTD_RD7                     76
#define SS2                           77
#define AD7                           78
#define PORTE                         79
#define PD2                           80
#define AD8                           81
#define RDE                           82
#define PORTE_RE0                     83
#define AD9                           84
#define WRE                           85
#define PORTE_RE1                     86
#define PC2                           87
#define CS                            88
#define CCP10                         89
#define PB2                           90
#define PORTE_RE2                     91
#define AD10                          92
#define PORTE_RE3                     93
#define CCP9E                         94
#define AD11                          95
#define PC3E                          96
#define PB3E                          97
#define PORTE_RE4                     98
#define AD12                          99
#define CCP8E                         100
#define PORTE_RE5                     101
#define CCP7E                         102
#define AD13                          103
#define PC1E                          104
#define CCP6E                         105
#define PORTE_RE6                     106
#define AD14                          107
#define PB1E                          108
#define CCP2E                         109
#define PA2E                          110
#define PORTE_RE7                     111
#define AD15                          112
#define PORTF                         113
#define PORTF_RF0                     114
#define AN5                           115
#define PORTF_RF1                     116
#define C2OUTF                        117
#define AN6                           118
#define PORTF_RF2                     119
#define AN7                           120
#define C1OUTF                        121
#define PORTF_RF3                     122
#define PORTF_CSIO                    123
#define PORTF_RF4                     124
#define CS2                           125
#define PORTF_RF5                     126
#define CS1                           127
#define PORTF_RF6                     128
#define LB                            129
#define PORTF_RF7                     130
#define UB                            131
#define PORTG                         132
#define ALE                           133
#define PORTG_RG0                     134
#define OE                            135
#define PORTG_RG1                     136
#define C3OUTG                        137
#define PORTG_RG2                     138
#define WRL                           139
#define WRH                           140
#define PORTG_RG3                     141
#define BA0                           142
#define PORTG_RG4                     143
#define PORTH                         144
#define PORTH_RH0                     145
#define A16                           146
#define PORTH_RH1                     147
#define A17                           148
#define PORTH_RH2                     149
#define A18                           150
#define PORTH_RH3                     151
#define A19                           152
#define PORTH_RH4                     153
#define CCP9                          154
#define AN8                           155
#define PC3                           156
#define PORTH_RH5                     157
#define CCP8                          158
#define AN9                           159
#define PB3                           160
#define PORTH_RH6                     161
#define CCP7                          162
#define PC1                           163
#define AN10                          164
#define PORTH_RH7                     165
#define CCP6                          166
#define PB1                           167
#define AN11                          168
#define PORTJ                         169
#define PORTJ_RJ0                     170
#define D0                            171
#define PORTJ_RJ1                     172
#define D1                            173
#define PORTJ_RJ2                     174
#define D2                            175
#define PORTJ_RJ3                     176
#define D3                            177
#define PORTJ_RJ4                     178
#define D4                            179
#define PORTJ_RJ5                     180
#define D5                            181
#define PORTJ_RJ6                     182
#define D6                            183
#define PORTJ_RJ7                     184
#define D7                            185
#define LATA                          186
#define LATA0                         187
#define LA0                           188
#define LATA1                         189
#define LA1                           190
#define LATA2                         191
#define LA2                           192
#define LATA3                         193
#define LA3                           194
#define LATA4                         195
#define LA4                           196
#define LATA5                         197
#define LA5                           198
#define LATB                          199
#define LB0                           200
#define LATB0                         201
#define LB1                           202
#define LATB1                         203
#define LB2                           204
#define LATB2                         205
#define LB3                           206
#define LATB3                         207
#define LB4                           208
#define LATB4                         209
#define LB5                           210
#define LATB5                         211
#define LB6                           212
#define LATB6                         213
#define LB7                           214
#define LATB7                         215
#define LATC                          216
#define LATC0                         217
#define LC0                           218
#define LATC1                         219
#define LC1                           220
#define LATC2                         221
#define LC2                           222
#define LATC3                         223
#define LC3                           224
#define LATC4                         225
#define LC4                           226
#define LATC5                         227
#define LC5                           228
#define LATC6                         229
#define LC6                           230
#define LATC7                         231
#define LC7                           232
#define LATD                          233
#define LATD0                         234
#define LD0                           235
#define LATD1                         236
#define LD1                           237
#define LATD2                         238
#define LD2                           239
#define LATD3                         240
#define LD3                           241
#define LATD4                         242
#define LD4                           243
#define LATD5                         244
#define LD5                           245
#define LATD6                         246
#define LD6                           247
#define LATD7                         248
#define LD7                           249
#define LATE                          250
#define LATE0                         251
#define LE0                           252
#define LATE1                         253
#define LE1                           254
#define LATE2                         255
#define LE2                           256
#define LATE3                         257
#define LE3                           258
#define LATE4                         259
#define LE4                           260
#define LATE5                         261
#define LE5                           262
#define LATE6                         263
#define LE6                           264
#define LATE7                         265
#define LE7                           266
#define LATF                          267
#define LATF0                         268
#define LF0                           269
#define LATF1                         270
#define LF1                           271
#define LF2                           272
#define LATF2                         273
#define LF3                           274
#define LATF3                         275
#define LF4                           276
#define LATF4                         277
#define LF5                           278
#define LATF5                         279
#define LF6                           280
#define LATF6                         281
#define LF7                           282
#define LATF7                         283
#define LATG                          284
#define LATG0                         285
#define LG0                           286
#define LATG1                         287
#define LG1                           288
#define LATG2                         289
#define LG2                           290
#define LATG3                         291
#define LG3                           292
#define LATG4                         293
#define LG4                           294
#define LATH                          295
#define LH0                           296
#define LATH0                         297
#define LH1                           298
#define LATH1                         299
#define LH2                           300
#define LATH2                         301
#define LH3                           302
#define LATH3                         303
#define LH4                           304
#define LATH4                         305
#define LH5                           306
#define LATH5                         307
#define LH6                           308
#define LATH6                         309
#define LH7                           310
#define LATH7                         311
#define LATJ                          312
#define LATJ0                         313
#define LJ0                           314
#define LATJ1                         315
#define LJ1                           316
#define LATJ2                         317
#define LJ2                           318
#define LATJ3                         319
#define LJ3                           320
#define LATJ4                         321
#define LJ4                           322
#define LATJ5                         323
#define LJ5                           324
#define LATJ6                         325
#define LJ6                           326
#define LATJ7                         327
#define LJ7                           328
#define TRISA                         329
#define TRISA_RA0                     330
#define TRISA0                        331
#define TRISA_RA1                     332
#define TRISA1                        333
#define TRISA2                        334
#define TRISA_RA2                     335
#define TRISA_RA3                     336
#define TRISA3                        337
#define TRISA_RA4                     338
#define TRISA4                        339
#define TRISA_RA5                     340
#define TRISA5                        341
#define TRISA_RA6                     342
#define RA7                           343
#define TRISB                         344
#define TRISB_RB0                     345
#define TRISB0                        346
#define TRISB_RB1                     347
#define TRISB1                        348
#define TRISB_RB2                     349
#define TRISB2                        350
#define TRISB_RB3                     351
#define TRISB3                        352
#define TRISB_RB4                     353
#define TRISB4                        354
#define TRISB_RB5                     355
#define TRISB5                        356
#define TRISB_RB6                     357
#define TRISB6                        358
#define TRISB_RB7                     359
#define TRISB7                        360
#define TRISC                         361
#define TRISC0                        362
#define TRISC_RC0                     363
#define TRISC1                        364
#define TRISC_RC1                     365
#define TRISC2                        366
#define TRISC_RC2                     367
#define TRISC3                        368
#define TRISC_RC3                     369
#define TRISC4                        370
#define TRISC_RC4                     371
#define TRISC5                        372
#define TRISC_RC5                     373
#define TRISC6                        374
#define TRISC_RC6                     375
#define TRISC7                        376
#define TRISC_RC7                     377
#define TRISD                         378
#define TRISD_RD0                     379
#define TRISD0                        380
#define TRISD_RD1                     381
#define TRISD1                        382
#define TRISD_RD2                     383
#define TRISD2                        384
#define TRISD_RD3                     385
#define TRISD3                        386
#define TRISD_RD4                     387
#define TRISD4                        388
#define TRISD_RD5                     389
#define TRISD5                        390
#define TRISD_RD6                     391
#define TRISD6                        392
#define TRISD_RD7                     393
#define TRISD7                        394
#define TRISE                         395
#define TRISE_RE0                     396
#define TRISE0                        397
#define TRISE1                        398
#define TRISE_RE1                     399
#define TRISE2                        400
#define TRISE_RE2                     401
#define TRISE_RE3                     402
#define TRISE3                        403
#define TRISE_RE4                     404
#define TRISE4                        405
#define TRISE_RE5                     406
#define TRISE5                        407
#define TRISE_RE6                     408
#define TRISE6                        409
#define TRISE_RE7                     410
#define TRISE7                        411
#define TRISF                         412
#define TRISF0                        413
#define TRISF_RF0                     414
#define TRISF_RF1                     415
#define TRISF1                        416
#define TRISF_RF2                     417
#define TRISF2                        418
#define TRISF3                        419
#define TRISF_RF3                     420
#define TRISF_RF4                     421
#define TRISF4                        422
#define TRISF_RF5                     423
#define TRISF5                        424
#define TRISF_RF6                     425
#define TRISF6                        426
#define TRISF7                        427
#define TRISF_RF7                     428
#define TRISG                         429
#define TRISG0                        430
#define TRISG_RG0                     431
#define TRISG1                        432
#define TRISG_RG1                     433
#define TRISG2                        434
#define TRISG_RG2                     435
#define TRISG_RG3                     436
#define TRISG3                        437
#define TRISG4                        438
#define TRISG_RG4                     439
#define TRISH                         440
#define TRISH_RH0                     441
#define TRISH0                        442
#define TRISH_RH1                     443
#define TRISH1                        444
#define TRISH_RH2                     445
#define TRISH2                        446
#define TRISH_RH3                     447
#define TRISH3                        448
#define TRISH_RH4                     449
#define TRISH4                        450
#define TRISH_RH5                     451
#define TRISH5                        452
#define TRISH_RH6                     453
#define TRISH6                        454
#define TRISH_RH7                     455
#define TRISH7                        456
#define TRISJ                         457
#define TRISJ_RJ0                     458
#define TRISJ0                        459
#define TRISJ_RJ1                     460
#define TRISJ1                        461
#define TRISJ_RJ2                     462
#define TRISJ2                        463
#define TRISJ_RJ3                     464
#define TRISJ3                        465
#define TRISJ_RJ4                     466
#define TRISJ4                        467
#define TRISJ_RJ5                     468
#define TRISJ5                        469
#define TRISJ_RJ6                     470
#define TRISJ6                        471
#define TRISJ_RJ7                     472
#define TRISJ7                        473
#define MEMCON                        474
#define WM                            475
#define WM0                           476
#define WM1                           477
#define WAIT0                         478
#define WAIT                          479
#define WAIT1                         480
#define PGRM                          481
#define EBDIS                         482
#define PIE1                          483
#define TMR1IE                        484
#define TMR2IE                        485
#define CCP1IE                        486
#define SSPIE                         487
#define TXIE                          488
#define TX1IE                         489
#define RCIE                          490
#define RC1IE                         491
#define ADIE                          492
#define PIR1                          493
#define TMR1IF                        494
#define TMR2IF                        495
#define CCP1IF                        496
#define SSPIF                         497
#define TXIF                          498
#define TX1IF                         499
#define RCIF                          500
#define RC1IF                         501
#define ADIF                          502
#define IPR1                          503
#define TMR1IP                        504
#define TMR2IP                        505
#define CCP1IP                        506
#define SSPIP                         507
#define TX1IP                         508
#define TXIP                          509
#define RC1IP                         510
#define RCIP                          511
#define ADIP                          512
#define PIE2                          513
#define CCP2IE                        514
#define TMR3IE                        515
#define LVDIE                         516
#define BCLIE                         517
#define PIR2                          518
#define CCP2IF                        519
#define TMR3IF                        520
#define LVDIF                         521
