tiborsimon/embedded-tdd-headers/pic/8bit/pic18c801_tdd.h
#define BCLIF                         522
#define IPR2                          523
#define CCP2IP                        524
#define TMR3IP                        525
#define LVDIP                         526
#define BCLIP                         527
#define CSELIO                        528
#define CSELIO_CSIO                   529
#define CSIO0                         530
#define CSIO1                         531
#define CSIO2                         532
#define CSIO3                         533
#define CSIO4                         534
#define CSIO5                         535
#define CSIO6                         536
#define CSIO7                         537
#define CSEL2                         538
#define CSL                           539
#define CSL0                          540
#define CSL1                          541
#define CSL2                          542
#define CSL3                          543
#define CSL4                          544
#define CSL5                          545
#define CSL6                          546
#define CSL7                          547
#define RCSTA                         548
#define RCD8                          549
#define RX9D                          550
#define OERR                          551
#define FERR                          552
#define ADDEN                         553
#define ADEN                          554
#define CREN                          555
#define SRENA                         556
#define SREN                          557
#define RC9                           558
#define RC8_9                         559
#define RX9                           560
#define SPEN                          561
#define TXSTA                         562
#define TXD8                          563
#define TX9D1                         564
#define TX9D                          565
#define TRMT                          566
#define TRMT1                         567
#define BRGH1                         568
#define BRGH                          569
#define SYNC                          570
#define SYNC1                         571
#define TXEN1                         572
#define TXEN                          573
#define TX91                          574
#define TX8_9                         575
#define TX9                           576
#define CSRC1                         577
#define CSRC                          578
#define PSPCON                        579
#define CMLK0                         580
#define CMLK                          581
#define CMLK1                         582
#define T3CON                         583
#define TMR3ON                        584
#define TMR3CS                        585
#define nT3SYNC                       586
#define NOT_T3SYNC                    587
#define T3SYNC                        588
#define T3INSYNC                      589
#define SOSCEN3                       590
#define T3CCP1                        591
#define T3CKPS                        592
#define T3CKPS0                       593
#define T3CKPS1                       594
#define T3CCP2                        595
#define T3CON_RD16                    596
#define RD163                         597
#define T3RD16                        598
#define CCP2CON                       599
#define CCP2M                         600
#define CCP2M0                        601
#define CCP2M1                        602
#define CCP2M2                        603
#define CCP2M3                        604
#define DC2B0                         605
#define CCP2Y                         606
#define DC2B                          607
#define DC2B1                         608
#define DCCPX                         609
#define CCP2X                         610
#define CCP1CON                       611
#define CCP1M0                        612
#define CCP1M                         613
#define CCP1M1                        614
#define CCP1M2                        615
#define CCP1M3                        616
#define CCP1Y                         617
#define DC1B                          618
#define DC1B0                         619
#define CCP1X                         620
#define DC1B1                         621
#define ADCON2                        622
#define ADCS                          623
#define ADCS0                         624
#define ADCS1                         625
#define ADCS2                         626
#define ADFM                          627
#define ADCON1                        628
#define PCFG0                         629
#define PCFG                          630
#define PCFG1                         631
#define PCFG2                         632
#define CHSN3                         633
#define PCFG3                         634
#define VCFG                          635
#define VCFG0                         636
#define VCFG01                        637
#define VCFG11                        638
#define VCFG1                         639
#define ADCON0                        640
#define ADON                          641
#define nDONE                         642
#define GO_nDONE                      643
#define NOT_DONE                      644
#define GODONE                        645
#define GO_DONE                       646
#define DONE                          647
#define GO_NOT_DONE                   648
#define GO                            649
#define CHS                           650
#define CHS0                          651
#define CHS1                          652
#define CHS2                          653
#define CHS3                          654
#define SSPCON2                       655
#define SEN                           656
#define RSEN                          657
#define PEN                           658
#define RCEN                          659
#define ACKEN                         660
#define ACKDT                         661
#define ACKSTAT                       662
#define GCEN                          663
#define SSPCON1                       664
#define SSPM0                         665
#define SSPM                          666
#define SSPM1                         667
#define SSPM2                         668
#define SSPM3                         669
#define CKP                           670
#define SSPEN                         671
#define SSPOV                         672
#define WCOL                          673
#define SSPSTAT                       674
#define BF                            675
#define UA                            676
#define R_NOT_W                       677
#define READ_WRITE                    678
#define NOT_W                         679
#define R_W                           680
#define RW                            681
#define R                             682
#define NOT_WRITE                     683
#define nW                            684
#define nWRITE                        685
#define R_nW                          686
#define I2C_READ                      687
#define START                         688
#define S                             689
#define I2C_START                     690
#define STOP                          691
#define I2C_STOP                      692
#define P                             693
#define NOT_A                         694
#define I2C_DATA                      695
#define nA                            696
#define D_nA                          697
#define D                             698
#define DA                            699
#define DATA_ADDRESS                  700
#define D_A                           701
#define D_NOT_A                       702
#define NOT_ADDRESS                   703
#define nADDRESS                      704
#define I2C_DAT                       705
#define CKE                           706
#define SMP                           707
#define T2CON                         708
#define T2CKPS0                       709
#define T2CKPS                        710
#define T2CKPS1                       711
#define TMR2ON                        712
#define TOUTPS0                       713
#define TOUTPS                        714
#define TOUTPS1                       715
#define TOUTPS2                       716
#define TOUTPS3                       717
#define T1CON                         718
#define TMR1ON                        719
#define TMR1CS                        720
#define NOT_T1SYNC                    721
#define T1SYNC                        722
#define nT1SYNC                       723
#define T1INSYNC                      724
#define T1OSCEN                       725
#define SOSCEN                        726
#define T1CKPS0                       727
#define T1CKPS                        728
#define T1CKPS1                       729
#define T1RD16                        730
#define T1CON_RD16                    731
#define RCON                          732
#define NOT_BOR                       733
#define nBOR                          734
#define POR                           735
#define nPOR                          736
#define NOT_POR                       737
#define nPD                           738
#define NOT_PD                        739
#define PD                            740
#define NOT_TO                        741
#define nTO                           742
#define TO                            743
#define nRI                           744
#define NOT_RI                        745
#define RI                            746
#define nIPEN                         747
#define IPEN                          748
#define NOT_IPEN                      749
#define WDTCON                        750
#define SWDTEN                        751
#define SWDTE                         752
#define SWDPS0                        753
#define WDPS0                         754
#define SWDPS                         755
#define SWDPS1                        756
#define WDPS1                         757
#define SWDPS2                        758
#define WDPS2                         759
#define LVDCON                        760
#define LVV0                          761
#define LVDL0                         762
#define LVDL                          763
#define LVV1                          764
#define LVDL1                         765
#define LVV2                          766
#define LVDL2                         767
#define LVV3                          768
#define LVDL3                         769
#define LVDEN                         770
#define IRVST                         771
#define OSCCON                        772
#define SCS0                          773
#define SCS                           774
#define SCS1                          775
#define PLLEN                         776
#define LOCK                          777
#define T0CON                         778
#define T0PS                          779
#define T0PS0                         780
#define T0PS1                         781
#define T0PS2                         782
#define PSA                           783
#define T0PS3                         784
#define T0SE                          785
#define T0CS                          786
#define T08BIT                        787
#define T016BIT                       788
#define TMR0ON                        789
#define STATUS                        790
#define C                             791
#define CARRY                         792
#define DC                            793
#define ZERO                          794
#define Z                             795
#define OV                            796
#define OVERFLOW                      797
#define N                             798
#define NEGATIVE                      799
#define INTCON3                       800
#define INT1IF                        801
#define INT1F                         802
#define INT2IF                        803
#define INT2F                         804
#define INT1E                         805
#define INT1IE                        806
#define INT2IE                        807
#define INT2E                         808
#define INT1P                         809
#define INT1IP                        810
#define INT2IP                        811
#define INT2P                         812
#define INTCON2                       813
#define RBIP                          814
#define TMR0IP                        815
#define T0IP                          816
#define INTEDG2                       817
#define INTEDG1                       818
#define INTEDG0                       819
#define RBPU                          820
#define NOT_RBPU                      821
#define nRBPU                         822
#define INTCON                        823
#define RBIF                          824
#define INT0F                         825
#define INT0IF                        826
#define T0IF                          827
#define TMR0IF                        828
#define RBIE                          829
#define INT0E                         830
#define INT0IE                        831
#define T0IE                          832
#define TMR0IE                        833
#define PEIE                          834
#define PEIE_GIEL                     835
#define GIEL                          836
#define GIE_GIEH                      837
#define GIE                           838
#define GIEH                          839
#define STKPTR0                       840
#define STKPTR                        841
#define SP0                           842
#define STKPTR1                       843
#define SP1                           844
#define STKPTR2                       845
#define SP2                           846
#define SP3                           847
#define STKPTR3                       848
#define STKPTR4                       849
#define SP4                           850
#define STKUNF                        851
#define STKOVF                        852
#define STKFUL                        853

#endif // _PIC18C801_H_
